{
    "人物访问": [
        "主观原因：访问动机、双方意图、领导人个人关系、外交策略",
        "客观事实：访问的具体安排、地点、参与方、访问前后的国际反应",
        "地缘政治：访问对所在地区及国际格局的影响",
        "经济与贸易：是否涉及经济协议或合作项目，经济利益的考量",
        "后续影响：访问对两国或国际关系的长期影响，是否引发政策改变或协议签订"
    ],
    "战略部署": [
        "主观原因：部署背后的战略意图（防御、攻击、威慑等）",
        "客观事实：军事部署的具体情况，部队或武器的调动，设施建设",
        "技术创新：新型武器或战术的应用与测试",
        "军事与政治：军事部署是否与政治决策或外交关系紧密相关",
        "地缘安全：部署是否会改变区域安全环境，引发周边国家反应",
        "社会反应：公众或媒体对战略部署的看法，是否产生恐慌或支持"
    ],
    "军事冲突": [
        "主观原因：领土争端、历史遗留问题、民族冲突、资源争夺",
        "客观事实：冲突爆发的具体事件、参战方、战斗经过",
        "军事策略：战斗双方的战略、战术及其变化",
        "社会与人道：战争对平民、难民、社会秩序的影响",
        "国际干预：其他国家是否参与调解或提供援助",
        "后续影响：冲突后的和平进程、战后重建、社会恢复、战犯追责"
    ],
    "政治变动": [
        "主观原因：政权更替、民众运动、政治腐败、政策失误",
        "客观事实：变动发生的具体时间、地点，主要政治人物的更替",
        "社会与文化：变动对社会文化、教育、思想意识的影响",
        "法律与制度：政治变动是否带来法律和体制的改革或变化",
        "国际影响：变动对其他国家或地区的影响，国际关系的重组",
        "民意反应：变动对公众的影响，是否带来社会动荡或支持"
    ],
    "外交事件": [
        "主观原因：外交意图、国家利益、战略目标",
        "客观事实：外交活动的性质（会议、协议、谈判等）、参与方",
        "地缘政治：外交事件对地区或全球格局的潜在影响",
        "经济合作：是否涉及经济协议、贸易协定或经济制裁",
        "文化与社会：文化交流是否被纳入外交议题，民间反应",
        "舆论与信息战：媒体对外交事件的报道与塑造，是否存在信息战"
    ],
    "科技与军事创新": [
        "主观原因：军事需求推动技术创新，国家安全考量",
        "客观事实：新技术的研发背景、技术细节、应用领域",
        "技术竞争：科技创新是否与其他国家的技术竞赛相关",
        "战略影响：新技术对战术、战略的改变，是否会改变战斗格局",
        "伦理与风险：技术应用中的伦理问题，潜在的安全风险",
        "后续发展：技术的普及、国际技术合作或封锁"
    ],
    "经济制裁与外交压力": [
        "主观原因：制裁动机（报复、压力、国家利益、外交施压）",
        "客观事实：制裁的范围、目标、实施方式及效果",
        "国际合作：制裁是否获得国际支持，是否涉及联合国或多国联合行动",
        "经济影响：制裁对目标国经济的具体影响，是否导致经济危机或改革",
        "社会反应：民众对制裁的反应，是否引发国内动荡或民间抗议",
        "后续影响：制裁后的外交关系恢复、解除制裁条件、国际制裁变动"
    ],
    "人道主义危机": [
        "主观原因：战乱、自然灾害、政治迫害导致的民生问题",
        "客观事实：灾难的发生时间、地点、受影响人数、国际救援行动",
        "社会影响：危机对社会秩序、公共卫生、难民流动的影响",
        "国际援助：国际组织、各国是否提供援助，援助的效率与挑战",
        "人权与道德：危机中的人权问题，国际社会对人权的关注与干预",
        "后续影响：危机结束后的恢复进程，社会再建与重建"
    ],
    "网络安全与信息战": [
        "主观原因：国家对网络攻击、信息控制的需求",
        "客观事实：网络攻击的发生、攻击目标、具体手段",
        "技术与创新：信息战中的技术应用，如大数据分析、人工智能",
        "社会反应：网络攻击对公众的影响，是否引发恐慌或社会动荡",
        "外交反应：国际社会的回应，是否采取经济制裁、外交抗议",
        "后续发展：事件后的防御加强、网络安全政策调整"
    ],
    "社会文化变动": [
        "主观原因：文化冲突、社会运动、民族认同等",
        "客观事实：社会变动的形式（抗议、文化表达、民族运动等）",
        "政治与法律：文化变动是否影响政策、法律改革或社会结构",
        "民族主义与全球化：文化变动中民族主义的崛起与全球化的关系",
        "媒体与舆论：媒体在文化变动中的作用，舆论的主导作用",
        "后续影响：文化变动对社会稳定、国际关系、经济的长期影响"
    ]
}
{
    "人物访问": [
        "主观原因", 
        "客观事实", 
        "地缘政治", 
        "经济与贸易", 
        "后续影响"
    ],
    "战略部署": [
        "主观原因", 
        "客观事实", 
        "技术创新", 
        "军事与政治", 
        "地缘安全", 
        "社会反应"
    ],
    "军事冲突": [
        "主观原因", 
        "客观事实", 
        "军事策略", 
        "社会与人道", 
        "国际干预", 
        "后续影响"
    ],
    "政治变动": [
        "主观原因", 
        "客观事实", 
        "社会与文化", 
        "法律与制度", 
        "国际影响", 
        "民意反应"
    ],
    "外交事件": [
        "主观原因", 
        "客观事实", 
        "地缘政治", 
        "经济合作", 
        "文化与社会", 
        "舆论与信息战"
    ],
    "科技与军事创新": [
        "主观原因", 
        "客观事实", 
        "技术竞争", 
        "战略影响", 
        "伦理与风险", 
        "后续发展"
    ],
    "经济制裁与外交压力": [
        "主观原因", 
        "客观事实", 
        "国际合作", 
        "经济影响", 
        "社会反应", 
        "后续影响"
    ],
    "人道主义危机": [
        "主观原因", 
        "客观事实", 
        "社会影响", 
        "国际援助", 
        "人权与道德", 
        "后续影响"
    ],
    "网络安全与信息战": [
        "主观原因", 
        "客观事实", 
        "技术与创新", 
        "社会反应", 
        "外交反应", 
        "后续发展"
    ],
    "社会文化变动": [
        "主观原因", 
        "客观事实", 
        "政治与法律", 
        "民族主义与全球化", 
        "媒体与舆论", 
        "后续影响"
    ]
}
